rainbowyu/atomthread/stm8sdriver.c
#include "myos.h"
#include "stm8sdriver.h"


extern const Myos_CoreData volatile Myos_Core0 __at(CONFIGURE_CORE0);



/****************************************************************STM8S系列微处理器通用驱动函数*****************************************************************/
/*
*函数名：MCU_FrequencyInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化时钟系统
*/
void MCU_FrequencyInit( void )
{
  CLK->ICKR = 0x29;                                                             //活跃停机模式下主电压调节器开、低速内部振荡器开、高速内部振荡器开
  while((CLK->ICKR & 0x12) != 0x12);                                            //等待振荡器就绪

  CLK->SWR     = 0xE1;                                                          //设置高速内部振荡器为主时钟源
  CLK->ECKR    = 0x00;                                                          //外部振荡器关
  CLK->CSSR    = 0x00;                                                          //时钟安全系统关
  CLK->SWCR    = 0x00;                                                          //清除时钟源切换标志及关闭时钟切换中断
  CLK->CKDIVR  = 0x00;                                                          //主时钟不分频,全速运行
  CLK->PCKENR1 = 0xFF;                                                          //打开所有外设时钟
  CLK->PCKENR2 = 0xFF;                                                          //打开所有外设时钟
}

/*
*函数名：MCU_ExitInterruptInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化外部中断触发方式
*/
void MCU_ExitInterruptInit( void )
{
  EXTI->CR1 = 0x55;                                                             //外部中断触发设置
  EXTI->CR2 = 0x55;                                                             //外部中断触发设置
}

/*
*函数名：MCU_GPIOAInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOA端口
*/
void MCU_GPIOAInit( void )
{
  GPIOA->ODR = 0x00;                                                            //GPIOA端口数据输出设置
  GPIOA->DDR = 0x08;                                                            //GPIOA端口数据方向设置
  GPIOA->CR1 = 0x08;                                                            //GPIOA端口属性配置
  GPIOA->CR2 = 0x00;                                                            //GPIOA端口属性配置
}

/*
*函数名：GPIOA_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：GPIOA端口的中断处理函数
*/
#pragma vector=0x05
__interrupt void GPIOA_Interrupt( void )
{
}

/*
*函数名：MCU_GPIOBInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOB端口
*/
void MCU_GPIOBInit( void )
{
  GPIOB->ODR = 0x00;                                                            //GPIOB端口数据输出设置
  GPIOB->DDR = 0x00;                                                            //GPIOB端口数据方向设置
  GPIOB->CR1 = 0x00;                                                            //GPIOB端口属性配置
  GPIOB->CR2 = 0x00;                                                            //GPIOB端口属性配置
}

/*
*函数名：GPIOB_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：GPIOB端口的中断处理函数
*/
#pragma vector=0x06
__interrupt void GPIOB_Interrupt( void )
{
}

/*
*函数名：MCU_GPIOCInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOC端口
*/
void MCU_GPIOCInit( void )
{
  GPIOC->ODR = 0x00;                                                            //GPIOC端口数据输出设置
  GPIOC->DDR = 0x00;                                                            //GPIOC端口数据方向设置
  GPIOC->CR1 = 0x00;                                                            //GPIOC端口属性配置
  GPIOC->CR2 = 0x00;                                                            //GPIOC端口属性配置
}

/*
*函数名：GPIOC_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：GPIOC端口的中断处理函数
*/
#pragma vector=0x07
__interrupt void GPIOC_Interrupt( void )
{
}

/*
*函数名：MCU_GPIODInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOD端口
*/
void MCU_GPIODInit( void )
{
  GPIOD->ODR = 0x00;                                                            //GPIOD端口数据输出设置
  GPIOD->DDR = 0x20;                                                            //GPIOD端口数据方向设置
  GPIOD->CR1 = 0x20;                                                            //GPIOD端口属性配置
  GPIOD->CR2 = 0x20;                                                            //GPIOD端口属性配置
}

/*
*函数名：GPIOD_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：GPIOD端口的中断处理函数
*/
#pragma vector=0x08
__interrupt void GPIOD_Interrupt( void )
{
}

/*
*函数名：MCU_GPIOEInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOE端口
*/
void MCU_GPIOEInit( void )
{
  GPIOE->ODR = 0x01;                                                            //GPIOE端口数据输出设置
  GPIOE->DDR = 0xC9;                                                            //GPIOE端口数据方向设置
  GPIOE->CR1 = 0xC9;                                                            //GPIOE端口属性配置
  GPIOE->CR2 = 0x00;                                                            //GPIOE端口属性配置
}

/*
*函数名：GPIOE_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：GPIOE端口的中断处理函数
*/
#pragma vector=0x09
__interrupt void GPIOE_Interrupt( void )
{
}

/*
*函数名：MCU_GPIOFInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOF端口
*/
void MCU_GPIOFInit( void )
{
  GPIOF->ODR = 0x00;                                                            //GPIOF端口数据输出设置
  GPIOF->DDR = 0x00;                                                            //GPIOF端口数据方向设置
  GPIOF->CR1 = 0x00;                                                            //GPIOF端口属性配置
  GPIOF->CR2 = 0x00;                                                            //GPIOF端口属性配置
}

/*
*函数名：GPIOF_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：GPIOF端口的中断处理函数
*/
#pragma vector=0x0A
__interrupt void GPIOF_Interrupt( void )
{
}

/*
*函数名：MCU_GPIOGInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化GPIOG端口
*/
void MCU_GPIOGInit( void )
{
  GPIOG->ODR = 0x02;                                                            //GPIOG端口数据输出设置
  GPIOG->DDR = 0x02;                                                            //GPIOG端口数据方向设置
  GPIOG->CR1 = 0x02;                                                            //GPIOG端口属性配置
  GPIOG->CR2 = 0x00;                                                            //GPIOG端口属性配置
}

/*
*函数名：MCU_FlashInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化设备的存储器
*/
void MCU_FlashInit( void )
{
  FLASH->CR1   = 0x00;                                                          //停机下关闭存储器
  FLASH->CR2   = 0x00;                                                          //系统存储器编程禁止
  FLASH->NCR2  = 0xFF;                                                          //CR2的互补寄存器
  FLASH->IAPSR = 0x00;                                                          //锁定存储器写保护
}

