rainbowyu/atomthread/stm8sdriver.c
/*
*函数名：MCU_OptionSet(unsigned char8 option, unsigned char8 noption, unsigned char8 value)
*入参：
  option：选项字节序号
  noption：选项字节是否有互补字节
  value：需要设置的值
*返回值：无
*作用域：本地
*函数作用：设置选项字节中的值
*/
void MCU_OptionSet(unsigned char8 option, unsigned char8 noption, unsigned char8 value)
{
  unsigned char8 timeout = 0xFF;
  unsigned char8 *address = ((void *)(option + 0x4800));                        //计算选项字节的存储基地址
  FLASH->CR2  = 0x80;                                                           //使能对选项字节的编程
  FLASH->NCR2 = 0x7F;                                                           //使能对选项字节的编程

  FLASH->DUKR = 0xAE;                                                           //写入第一个秘钥
  FLASH->DUKR = 0x56;                                                           //写入第二个秘钥
  while(((FLASH->IAPSR) & 0x08) == 0x00 && (-- timeout) > 0x00);                //等待解密就绪

  *(address ++) = value;                                                        //写入配置数据
  if(noption > 0x00){*address = (~value);}                                      //写入互补数据
  FLASH->IAPSR = 0x00;                                                          //重新锁定写保护
  FLASH->CR2  = 0x00;                                                           //禁止对选项字节的编程
  FLASH->NCR2 = 0xFF;                                                           //禁止对选项字节的编程
}

/*
*函数名：MCU_ChipSerial(unsigned char8 *cache)
*入参：
  cache：芯片序列号的缓存地址
*返回值：无
*作用域：本地
*函数作用：获取芯片的唯一序列号
*/
void MCU_ChipSerial(unsigned char8 *cache)
{
  unsigned char8 count = 0x07;
  unsigned char8 *address = ((void *)(0x48D2));                                 //芯片序列号基地址计算
  if(cache == 0x00){return ;}                                                   //入参检查
  while((count --) > 0x00){*(cache ++) = *(address ++);}                        //读取芯片序列号
}

/*
*函数名：MCU_EEPROMWrite(unsigned short16 offset, unsigned short16 length, unsigned char8 *cache)
*入参：
  offset：写入的偏移数
  length：写入的数据长度
  cache：写入的数据缓存
*返回值：无
*作用域：本地
*函数作用：向EEPROM中写入数据
*/
void MCU_EEPROMWrite(unsigned short16 offset, unsigned short16 length, unsigned char8 *cache)
{
  unsigned char8 timeout = 0xFF;
  unsigned char8 *address = ((void *)(offset + 0x4000));                        //计算数据的EEPROM存储基地址
  if(cache == 0x00){return ;}                                                   //入参检查

  FLASH->DUKR = 0xAE;                                                           //写入第一个秘钥
  FLASH->DUKR = 0x56;                                                           //写入第二个秘钥
  while(((FLASH->IAPSR) & 0x08) == 0x00 && (-- timeout) > 0x00);                //等待解密就绪

  while((length --) > 0x00){*(address ++) = *(cache ++);}                       //数据写入
  FLASH->IAPSR = 0x00;                                                          //重新锁定写保护
}

/*
*函数名：MCU_EEPROMRead(unsigned short16 offset, unsigned short16 length, unsigned char8 *cache)
*入参：
  offset：读取的偏移数
  length：读取的数据大小
  cache：读取的数据缓存
*返回值：无
*作用域：本地
*函数作用：从EEPROM中读取数据
*/
void MCU_EEPROMRead(unsigned short16 offset, unsigned short16 length, unsigned char8 *cache)
{
  unsigned char8 *address = ((void *)(offset + 0x4000));                        //计算数据的EEPROM存储基地址
  if(cache == 0x00){return ;}                                                   //入参检查
  while((length --) > 0x00){*(cache ++) = *(address ++);}                       //读取数据
}

/*
*函数名：MCU_BEEPInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化蜂鸣器控制器
*/
void MCU_BEEPInit( void )
{
//  MCU_OptionSet(0x03,0x01,0x80);                                                //是否允许BEEP输出
  BEEP->CSR = 0x4E;                                                             //初始化为BEEP频率为2KHZ
}

/*
*函数名：MCU_BEEPSet(unsigned char8 status)
*入参：
  status：状态变量
*返回值：无
*作用域：本地
*函数作用：设置蜂鸣器的状态
*/
void MCU_BEEPSet(unsigned char8 status)
{
  if(status > 0x00){BEEP->CSR |= 0x20;}else{BEEP->CSR &= 0xDF;}                 //设置蜂鸣器的状态
}

/*
*函数名：MCU_SPIInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化SPI通信接口
*/
void MCU_SPIInit( void )
{
  SPI->SR  = 0x00;                                                              //清空通信标志位
//  SPI->ICR = 0x40;                                                              //打开SPI的接收完成中断
  SPI->CR2 = 0x03;                                                              //配置SPI为双线单向,设置从设备使能为软件控制,内部使能设置为主设备
  SPI->CR1 = 0x4C;                                                              //设置SPI为MSB先发,时钟四分频,配置为主设备,空闲为低电平从第一个时钟沿采样数据,同时启动SPI运行
}

/*
*函数名：MCU_SPIRead(unsigned char8 data)
*入参：
  data：需要回复的数据
*返回值：主机发送的数据及是否超时
*作用域：本地
*函数作用：读取SPI接收到的数据并在下一个通信周期回复主机数据
*/
unsigned short16 MCU_SPIRead(unsigned char8 data)
{
  unsigned short16 regist = 0xFF;
  while((SPI->SR & 0x01) == 0x00 && (-- regist) > 0x00);                        //判断是否接收完成
  regist = ((regist << 0x08) | SPI->DR);                                        //读取收到的数据
  SPI->DR = data;                                                               //将数据写入SPI缓冲
  return regist;
}

/*
*函数名：MCU_SPISend(unsigned char8 data)
*入参：
  data：需要发送的数据
*返回值：从机回复的数据及是否超时
*作用域：本地
*函数作用：通过SPI发送数据并接受从机返回的数据
*/
unsigned short16 MCU_SPISend(unsigned char8 data)
{
  unsigned short16 regist = 0xFF;
  SPI->DR = data;                                                               //将数据写入SPI缓冲
  while((SPI->SR & 0x01) == 0x00 && (-- regist) > 0x00);                        //判断是否接收完成
  regist = ((regist << 0x08) | SPI->DR);                                        //读取收到的数据
  return regist;
}

/*
*函数名：SPI_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：SPI通信接口的中断处理函数
*/
#pragma vector=0x0C
__interrupt void SPI_Interrupt( void )
{
  unsigned char8 regist = SPI->DR;                                              //清空传输完成标志
  SPI->SR = (regist & 0x00);                                                    //清空状态标识位
}

/*
*函数名：MCU_TIM1Init( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化TIM1定时器
*/
void MCU_TIM1Init( void )
{
  TIM1->SR1 = 0x00;                                                             //清空事件标识位
  TIM1->SR2 = 0x00;                                                             //清空捕获事件标志位

  TIM1->CR1 = 0x80;                                                             //开启预装载
  TIM1->CR2 = 0x00;                                                             //不作为主定时器使用

  TIM1->PSCRH = 0x00;                                                           //设置高位分频器
  TIM1->PSCRL = 0x0F;                                                           //设置低位分频器

