rainbowyu/atomthread/stm8sdriver.c
  TIM1->CNTRH = 0x00;                                                           //清空高位计时器
  TIM1->CNTRL = 0x00;                                                           //清空低位计时器

  TIM1->ARRH = 0x03;                                                            //设置高位预装载寄存器
  TIM1->ARRL = 0xE8;                                                            //设置低位预装载寄存器

  TIM1->CCR1H = 0x00;                                                           //设置通道1占空比
  TIM1->CCR1L = 0x01;                                                           //设置通道1占空比

  TIM1->CCR2H = 0x00;                                                           //设置通道2占空比
  TIM1->CCR2L = 0x02;                                                           //设置通道2占空比

  TIM1->CCR3H = 0x00;                                                           //设置通道3占空比
  TIM1->CCR3L = 0x03;                                                           //设置通道3占空比

  TIM1->CCR4H = 0x00;                                                           //设置通道4占空比
  TIM1->CCR4L = 0x04;                                                           //设置通道4占空比

  TIM1->CCMR1 = 0x68;                                                           //设置通道1为PWM1模式,开始预装载使能并设置通道为输出模式
  TIM1->CCMR2 = 0x68;                                                           //设置通道2为PWM1模式,开始预装载使能并设置通道为输出模式
  TIM1->CCMR3 = 0x68;                                                           //设置通道3为PWM1模式,开始预装载使能并设置通道为输出模式
  TIM1->CCMR4 = 0x68;                                                           //设置通道4为PWM1模式,开始预装载使能并设置通道为输出模式

  TIM1->CCER1 = 0x33;                                                           //设置通道1、2的输出使能,半字节的最低位启用,并开启反相输出,即低电平有效
  TIM1->CCER2 = 0x33;                                                           //设置通道3、4的输出使能,半字节的最低位启用,并开启反相输出,即低电平有效

  TIM1->BKR = 0x80;                                                             //设置主输出使能
  TIM1->IER = 0x43;                                                             //中断控制寄存器,允许更新中断和比较中断,比较中断源设置为仅通道1
  TIM1->CR1 = 0x81;                                                             //开启预装载,边沿向上计数,允许发生更新事件并启动定时器
}

/*
*函数名：TIM1_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM1的更新中断处理函数
*/
#pragma vector=0x0D
__interrupt void TIM1_Interrupt( void )
{
  TIM1->SR1 = 0x00;                                                             //清空标志位
}

/*
*函数名：TIM1_CompareInterrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM1的比较中断处理函数
*/
#pragma vector=0x0E
__interrupt void TIM1_CompareInterrupt( void )
{
  TIM1->SR1 = 0x00;                                                             //清空标志位
}

/*
*函数名：MCU_TIM2Init( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化TIM2定时器
*/
void MCU_TIM2Init( void )
{
  TIM2->SR1 = 0x00;                                                             //清空事件标识位
  TIM2->SR2 = 0x00;                                                             //清空捕获事件标志位

  TIM2->CR1 = 0x80;                                                             //开启预装载

  TIM2->PSCR = 0x04;                                                            //设置分频器

  TIM2->CNTRH = 0x00;                                                           //清空高位计时器
  TIM2->CNTRL = 0x00;                                                           //清空低位计时器

  TIM2->ARRH = 0xFF;                                                            //设置高位预装载寄存器
  TIM2->ARRL = 0xFF;                                                            //设置低位预装载寄存器

  TIM2->CCR1H = 0x00;                                                           //清空通道1捕获值
  TIM2->CCR1L = 0x00;                                                           //清空通道1捕获值

  TIM2->CCR2H = 0x00;                                                           //清空通道2捕获值
  TIM2->CCR2L = 0x00;                                                           //清空通道2捕获值

  TIM2->CCR3H = 0x03;                                                           //设置通道3的占空比
  TIM2->CCR3L = 0xE8;                                                           //设置通道3的占空比

  TIM2->CCMR1 = 0x31;                                                           //设置通道1为捕获模式,设置为8次采样滤波并映射到捕获通道1节点1
  TIM2->CCMR2 = 0x32;                                                           //设置通道2为捕获模式,设置为8次采样滤波并映射到捕获通道1节点2
  TIM2->CCMR3 = 0x68;                                                           //设置通道3为PWM1模式,开始预装载使能并设置通道为输出模式

  TIM2->CCER1 = 0x31;                                                           //设置通道1为上升沿捕获、通道2为下降沿捕获
  TIM2->CCER2 = 0x01;                                                           //设置通道3输出使能、通道4的输出禁止

  TIM2->IER = 0x43;                                                             //中断控制寄存器,允许更新中断和捕获中断,捕获通道设置为捕获通道1
  TIM2->CR1 = 0x81;                                                             //开启预装载,边沿向上计数,允许发生更新事件并启动定时器
}

/*
*函数名：TIM2_Interrupt(void)
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM2的更新中断处理函数
*/
#pragma vector=0x0F
__interrupt void TIM2_Interrupt(void)
{
  TIM2->SR1 = 0x00;                                                             //清空标志位
}

/*
*函数名：TIM2_CompareInterrupt(void)
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM2的捕获中断处理函数
*/
#pragma vector=0x10
__interrupt void TIM2_CompareInterrupt(void)
{
  TIM2->SR1 = 0x00;                                                             //清空标志位
}

/*
*函数名：MCU_TIM3Init( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化TIM3定时器
*/
void MCU_TIM3Init( void )
{
  TIM3->SR1 = 0x00;                                                             //清空事件标识位
  TIM3->SR2 = 0x00;                                                             //清空捕获事件标志位

  TIM3->CR1 = 0x80;                                                             //开启预装载

  TIM3->PSCR = 0x04;                                                            //设置分频器

  TIM3->CNTRH = 0x00;                                                           //清空高位计时器
  TIM3->CNTRL = 0x00;                                                           //清空低位计时器

  TIM3->ARRH = 0x27;                                                            //设置高位预装载寄存器
  TIM3->ARRL = 0x10;                                                            //设置低位预装载寄存器

  TIM3->CCR1H = 0x03;                                                           //设置通道1的占空比
  TIM3->CCR1L = 0xE8;                                                           //设置通道1的占空比

  TIM3->CCR2H = 0x00;                                                           //设置通道2的占空比
  TIM3->CCR2L = 0x00;                                                           //设置通道2的占空比

