rainbowyu/atomthread/stm8sdriver.c
  TIM3->CCMR1 = 0x68;                                                           //设置通道1为PWM1模式,开始预装载使能并设置通道为输出模式
  TIM3->CCMR2 = 0x68;                                                           //设置通道2为PWM1模式,开始预装载使能并设置通道为输出模式

  TIM3->CCER1 = 0x00;                                                           //设置通道1、2禁止输出

  TIM3->IER = 0x43;                                                             //中断控制寄存器,允许更新中断和捕获中断,捕获通道设置为捕获通道1
  TIM3->CR1 = 0x81;                                                             //开启预装载,边沿向上计数,允许发生更新事件并启动定时器
}

/*
*函数名：TIM3_Interrupt(void)
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM3的更新中断处理函数
*/
#pragma vector=0x11
__interrupt void TIM3_Interrupt(void)
{
  TIM3->SR1 = 0x00;                                                             //清空标志位
  OS_ComUpdate();                                                               //通信组件时钟基准
}

/*
*函数名：TIM3_CompareInterrupt(void)
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM3的比较中断处理函数
*/
#pragma vector=0x12
__interrupt void TIM3_CompareInterrupt(void)
{
  TIM3->SR1 = 0x00;                                                             //清空标志位
}

/*
*函数名：MCU_UART1Init(unsigned int32 baudrate)
*入参：
  baudrate：串口波特率
*返回值：无
*作用域：本地
*函数作用：初始化UART1通信接口
*/
void MCU_UART1Init(unsigned int32 baudrate)
{
  unsigned short16 regist = (((CLK->CKDIVR) >> 0x03) & 0x03);                   //获取主时钟的分频系数

  switch (regist){                                                              //计算当前的分频系数
    case (0x00):{regist = 0x01;break;}                                          //不分频
    case (0x01):{regist = 0x02;break;}                                          //二分频
    case (0x02):{regist = 0x04;break;}                                          //四分频
    case (0x03):{regist = 0x08;break;}                                          //八分频
    default:{regist = 0x08;break;}                                              //未定义状态统一默认为八分频
  }
  regist = 16000000 / (baudrate * regist);                                      //计算实际的波特率

  UART1->BRR2 = (((regist >> 0x08) & 0xF0) | (regist & 0x0F));                  //先设置波特率控制寄存器BRR2
  UART1->BRR1 = ((regist >> 0x04) & 0xFF);                                      //后设置波特率控制寄存器BRR1

  UART1->SR   = 0x00;                                                           //清空通信标志位
  UART1->CR2  = 0x2C;                                                           //开启发送和接收,并打开接收中断
  UART1->CR3  = 0x00;                                                           //设置为1个停止位,不启用同步时钟
  UART1->CR4  = 0x00;                                                           //不启用LIN功能
  UART1->CR5  = 0x00;                                                           //不启用智能卡和红外模式
  UART1->GTR  = 0x00;                                                           //使用默认智能卡保护时间
  UART1->PSCR = 0x00;                                                           //不使用智能卡和红外分频
  UART1->CR1  = 0x00;                                                           //使能UART并禁用校验功能
}

/*
*函数名：MCU_UART1Send(unsigned char8 data)
*入参：
  data：需要发送的数据
*返回值：是否等待超时
*作用域：本地
*函数作用：通过UART1发送一个数据
*/
unsigned char8 MCU_UART1Send(unsigned char8 data)
{
  unsigned char8 regist = 0xFF;                                                 //等待超时变量
  while(((UART1->SR & 0x80) == 0x00) && (-- regist) > 0x00);                    //等待发送缓存空
  UART1->DR = data;                                                             //将数据写入发送缓存
  return regist;
}

/*
*函数名：MCU_UART1Read( void )
*入参：无
*返回值：读取到的数据及是否超时
*作用域：本地
*函数作用：读取UART1收到的数据
*/
unsigned short16 MCU_UART1Read( void )
{
  unsigned short16 regist = 0xFF;                                               //等待超时变量
  while(((UART1->SR & 0x20) == 0x00) && (-- regist) > 0x00);                    //等待数据接收完成
  regist = ((regist << 0x08) | UART1->DR);                                      //读出收到的数据
  return regist;
}

/*
*函数名：UART1_TxInterrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：UART1数据发送完成中断
*/
#pragma vector=0x13
__interrupt void UART1_TxInterrupt( void )
{
}

/*
*函数名：UART1_RxInterrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：UART1数据接收完成中断
*/
#pragma vector=0x14
__interrupt void UART1_RxInterrupt( void )
{
  MCU_UART1Read();                                                              //读取接收到的数据
}

/*
*函数名：MCU_IICInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化IIC通信接口
*/
void MCU_IICInit( void )
{
  I2C->CR2    = 0x00;                                                           //清空复位标识
  I2C->SR1    = 0x00;                                                           //清空通信标志
  I2C->SR2    = 0x00;                                                           //清空错误标志
  I2C->SR3    = 0x00;                                                           //清空状态标志
//  I2C->ITR    = 0x06;                                                           //打开IIC的事件中断

  I2C->CCRH   = 0x80;                                                           //设置IIC为1:2占空比快速模式
  I2C->CCRL   = 0x07;                                                           //设置IIC的波特率,381KHZ传输速率
  I2C->TRISER = 0x09;                                                           //设置最大上升时间为1微秒
  I2C->FREQR  = 0x08;                                                           //设置IIC为8MHZ时钟频率

  I2C->OARL   = (0x56 << 0x01);                                                 //设置IIC自身的设备地址
  I2C->OARH   = 0x40;                                                           //设置IIC设备地址为7位模式
  I2C->CR1    = 0x01;                                                           //使能IIC设备
  I2C->CR2    = 0x04;                                                           //使能应答标识
}

/*
*函数名：MCU_IICReset( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：复位IIC通信接口
*/
void MCU_IICReset( void )
{
  I2C->CR2 |= 0x80;                                                             //复位一次IIC通信接口
  MCU_IICInit();                                                                //复位后再次初始化IIC通信接口
}

/*
*函数名：MCU_IICACK(unsigned char8 mode)
*入参：
  mode：应答信号使能
*返回值：无
*作用域：本地
*函数作用：设置IIC应答使能
*/
void MCU_IICACK(unsigned char8 mode)
{
  if(mode == 0x00){I2C->CR2 = 0x00;}else{I2C->CR2 = 0x04;}                      //设置应答使能
}

