rainbowyu/atomthread/stm8sdriver.c
/*
*函数名：MCU_IICAddress(unsigned char8 address)
*入参：
  address：设备地址
*返回值：无
*作用域：本地
*函数作用：设置IIC通信接口的设备地址
*/
void MCU_IICAddress(unsigned char8 address)
{
  I2C->OARL = (address << 0x01);                                                //设置I2C通信接口自身的设备地址
}

/*
*函数名：MCU_IICStart(unsigned char8 address)
*入参：
  address：需要通信的从机地址
*返回值：起始条件发生是否超时
*作用域：本地
*函数作用：启动IIC产生起始位并发送从机地址
*/
unsigned short16 MCU_IICStart(unsigned char8 address)
{
  unsigned short16 timeout = 0x03FF;                                            //超时检测变量
  if(I2C->ITR != 0x00){return 0x00;}                                            //如果打开了中断则不允许设置为主模式

  I2C->CR2 |= 0x01;                                                             //产生起始条件
  while((I2C->SR1 & 0x01) == 0x00 && (-- timeout) > 0x00);                      //等待起始条件发送完成

  I2C->DR = address;                                                            //发送从设备地址
  while((I2C->SR1 & 0x02) == 0x00 && (-- timeout) > 0x00);                      //等待从设备应答

  address = I2C->SR3;                                                           //读一次SR3寄存器
  if(timeout == 0x00){MCU_IICReset();}                                          //如果发起通信超时则复位IIC通信接口
  return timeout;
}

/*
*函数名：MCU_IICStop( void )
*入参：无
*返回值：停止条件发生是否超时
*作用域：本地
*函数作用：使能IIC产生停止位
*/
unsigned short16 MCU_IICStop( void )
{
  unsigned short16 timeout = 0x03FF;                                            //超时检测变量
  if(I2C->ITR != 0x00){return 0x00;}                                            //如果打开了中断则不允许设置为主模式

  I2C->SR1 = 0x00;                                                              //清空传输标识
  I2C->CR2 |= 0x02;                                                             //产生停止条件
  while((I2C->CR2 & 0x02) > 0x00 && ((-- timeout) > 0x00));                     //等待停止条件发送完成

  if(timeout == 0x00){MCU_IICReset();}                                          //如果停止条件发送超时则复位IIC通信接口
  return timeout;
}

/*
*函数名：MCU_IICSend(unsigned char8 data)
*入参：
  data：需要发送的数据
*返回值：是否应答或超时
*作用域：本地
*函数作用：通过IIC发送一个字节
*/
unsigned char8 MCU_IICSend(unsigned char8 data)
{
  unsigned char8 timeout = 0xFF;                                                //超时检测变量
  if((I2C->SR3 & 0x04) == 0x00){return 0x00;}                                   //当前处在接收模式
  while((I2C->SR1 & 0x80) == 0x00 && ((-- timeout) > 0x00));                    //等待发送缓冲区空

  if(timeout == 0x00){                                                          //如果数据发送超时则复位IIC通信接口
    MCU_IICReset();                                                             //IIC通信接口复位
    return 0x00;                                                                //返回发送失败标志
  }else{
    I2C->SR1 = 0x00;                                                            //清空传输标志
    I2C->SR2 = 0x00;                                                            //清除状态标识
    I2C->DR  = data;                                                            //将数据写入发送缓存
    return ((I2C->SR2 & 0x04) == 0x00);                                         //检查从机应答
  }
}

/*
*函数名：MCU_IICRead( void )
*入参：无
*返回值：收到的数据及是否超时
*作用域：本地
*函数作用：读取IIC接收到的数据
*/
unsigned short16 MCU_IICRead( void )
{
  unsigned short16 regist = 0x00FF;                                             //超时检测变量
  if((I2C->SR3 & 0x04) > 0x00){return 0x00;}                                    //当前处在发送模式
  while((I2C->SR1 & 0x40) == 0x00 && ((-- regist) > 0x00));                     //等待当前的数据接收完成
  regist = ((regist << 0x08) | I2C->DR);                                        //读取收到的数据
  return regist;
}

/*
*函数名：IIC_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：IIC通信接口事件中断
*/
#pragma vector=0x15
__interrupt void IIC_Interrupt( void )
{
  unsigned char8 regist = I2C->SR1;                                             //读取SR1寄存器

  if((regist & 0x02) > 0x00){                                                   //地址匹配
  }

  if((regist & 0x04) > 0x00){                                                   //数据丢失
    MCU_IICReset();                                                             //复位IIC通信接口
  }

  if((regist & 0x10) > 0x00){                                                   //如果检测到停止位
    I2C->CR2 = 0x04;                                                            //重置CR2寄存器以清除停止位检测标志
  }

  if((regist & 0x40) > 0x00){                                                   //数据接收完成
    regist = MCU_IICRead();                                                     //读取收到的数据
  }

  if((regist & 0x80) > 0x00){                                                   //数据发送完成
  }
}

/*
*函数名：MCU_UART3Init(unsigned int32 baudrate)
*入参：
  baudrate：串口波特率
*返回值：无
*作用域：本地
*函数作用：初始化UART3通信接口
*/
void MCU_UART3Init(unsigned int32 baudrate)
{
  unsigned short16 regist = (((CLK->CKDIVR) >> 0x03) & 0x03);                   //获取主时钟的分频系数

  switch (regist){                                                              //计算当前的分频系数
    case (0x00):{regist = 0x01;break;}                                          //不分频
    case (0x01):{regist = 0x02;break;}                                          //二分频
    case (0x02):{regist = 0x04;break;}                                          //四分频
    case (0x03):{regist = 0x08;break;}                                          //八分频
    default:{regist = 0x08;break;}                                              //未定义状态统一默认为八分频
  }
  regist = 16000000 / (baudrate * regist);                                      //计算实际的波特率

  UART3->BRR2 = (((regist >> 0x08) & 0xF0) | (regist & 0x0F));                  //先设置波特率控制寄存器BRR2
  UART3->BRR1 = ((regist >> 0x04) & 0xFF);                                      //后设置波特率控制寄存器BRR1

  UART3->SR   = 0x00;                                                           //清空通信标志位
  UART3->CR2  = 0x2C;                                                           //开启发送和接收,并打开接收中断
  UART3->CR3  = 0x00;                                                           //设置为1个停止位,不启用同步时钟
  UART3->CR4  = 0x00;                                                           //不启用LIN功能
  UART3->CR6  = 0x00;                                                           //不启用LIN功能
  UART3->CR1  = 0x00;                                                           //使能UART并禁用校验功能
}

