rainbowyu/atomthread/stm8sdriver.c
/*
*函数名：MCU_UART3Send(unsigned char8 data)
*入参：
  data：需要发送的数据
*返回值：是否等待超时
*作用域：本地
*函数作用：通过UART3发送一个数据
*/
unsigned char8 MCU_UART3Send(unsigned char8 data)
{
  unsigned char8 regist = 0xFF;                                                 //等待超时变量
  while(((UART3->SR & 0x80) == 0x00) && (-- regist) > 0x00);                    //等待发送缓存空
  UART3->DR = data;                                                             //将数据写入发送缓存
  return regist;
}

/*
*函数名：MCU_UART3Read( void )
*入参：无
*返回值：读取到的数据及是否超时
*作用域：本地
*函数作用：读取UART3收到的数据
*/
unsigned short16 MCU_UART3Read( void )
{
  unsigned short16 regist = 0xFF;                                               //等待超时变量
  while(((UART3->SR & 0x20) == 0x00) && (-- regist) > 0x00);                    //等待数据接收完成
  regist = ((regist << 0x08) | UART3->DR);                                      //读出收到的数据
  return regist;
}

/*
*函数名：UART3_TxInterrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：UART3数据发送完成中断
*/
#pragma vector=0x16
__interrupt void UART3_TxInterrupt( void )
{
}

/*
*函数名：UART3_RxInterrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：UART3数据接收完成中断
*/
#pragma vector=0x17
__interrupt void UART3_RxInterrupt( void )
{
  MCU_UART3Read();                                                              //读取接收到的数据
}

/*
*函数名：MCU_ADCInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化模数转换器
*/
void MCU_ADCInit( void )
{
//  ADC2->CSR  = 0x20;                                                            //清除转换标志及转换通道并打开转换完成中断
  ADC2->CR2  = 0x08;                                                            //设置不外部触发、数据右对齐、不开启扫描
  ADC2->TDRH = 0xFF;                                                            //关闭所有ADC端口引脚的施密特触发器
  ADC2->TDRL = 0xFF;                                                            //关闭所有ADC端口引脚的施密特触发器
  ADC2->CR1  = 0x01;                                                            //设置ADC不分频、单次转换
}

/*
*函数名：MCU_ADCChannel(unsigned char8 channel)
*入参：
  channl：模拟通道号通道
*返回值：无
*作用域：本地
*函数作用：更改模数转换器的采样通道
*/
void MCU_ADCChannel(unsigned char8 channel)
{
  ADC2->CSR = (channel & 0x0F);                                                 //写入转换通道
}

/*
*函数名：MCU_ADCStart( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：启动一次模数转换
*/
void MCU_ADCStart( void )
{
  ADC2->CR1 |= 0x01;                                                            //启动模数转换器开始转换
}

/*
*函数名：MCU_GetADCValue( void )
*入参：无
*返回值：转换好的数字量
*作用域：本地
*函数作用：读取模数转换器的转换值
*/
unsigned short16 MCU_ADCValue( void )
{
  unsigned short16 regist;
  while((ADC2->CSR & 0x80) == 0x00);                                            //等待转换完成
  ADC2->CSR &= 0x7F;                                                            //清空转换标志位
  regist = ADC2->DRL;                                                           //获取模数转换器的低位
  regist = ((ADC2->DRH << 0x08) | regist);                                      //获取模数转换器的高位
  return regist;
}

/*
*函数名：ADC_Interrupt( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：数模转换完成中断
*/
#pragma vector=0x18
__interrupt void ADC_Interrupt( void )
{
  MCU_ADCValue();                                                               //获取ADC的转换数据
}

/*
*函数名：MCU_TIM4Init( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化TIM4定时器
*/
void MCU_TIM4Init( void )
{
  TIM4->SR1  = 0x00;                                                            //清空事件标识位
  TIM4->PSCR = 0x06;                                                            //设置分频器
  TIM4->CNTR = 0x00;                                                            //清空计时器
  TIM4->ARR  = 0xFA;                                                            //设置预装载寄存器
  TIM4->IER  = 0x01;                                                            //中断控制寄存器,允许更新中断
  TIM4->CR1  = 0x81;                                                            //开启预装载并使能定时器
}

/*
*函数名：TIM4_Interrupt(void)
*入参：无
*返回值：无
*作用域：本地
*函数作用：TIM4的更新中断处理函数
*/
#pragma vector=0x19
__interrupt void TIM4_Interrupt(void)
{
/*************由于编译器没有将R4到R7寄存器入栈需要在中断进入时压栈*************/
  asm("         LDW     X, 0x08         ");                                     //R4转移到X寄存器
  asm("         PUSHW   X               ");                                     //X寄存器入栈
  asm("         LDW     X, 0x0A         ");                                     //R5转移到X寄存器
  asm("         PUSHW   X               ");                                     //X寄存器入栈
  asm("         LDW     X, 0x0C         ");                                     //R6转移到X寄存器
  asm("         PUSHW   X               ");                                     //X寄存器入栈
  asm("         LDW     X, 0x0E         ");                                     //R7转移到X寄存器
  asm("         PUSHW   X               ");                                     //X寄存器入栈

  TIM4->SR1 = 0x00;
  (Myos_Core0.ThreadDispatch)();                                                //线程调度执行

/*************由于编译器没有将R4到R7寄存器出栈需要在中断出栈时出栈*************/
  asm("         POPW    X               ");                                     //出栈到X寄存器
  asm("         LDW     0x0E, X         ");                                     //转移到R7
  asm("         POPW    X               ");                                     //出栈到X寄存器
  asm("         LDW     0x0C, X         ");                                     //转移到R6
  asm("         POPW    X               ");                                     //出栈到X寄存器
  asm("         LDW     0x0A, X         ");                                     //转移到R5
  asm("         POPW    X               ");                                     //出栈到X寄存器
  asm("         LDW     0x08, X         ");                                     //转移到R4
}

/*
*函数名：MCU_ChipInit( void )
*入参：无
*返回值：无
*作用域：本地
*函数作用：初始化芯片的外设组件
*/
void MCU_ChipInit( void )
{
  MCU_FrequencyInit();                                                          //系统主时钟初始化
  MCU_ExitInterruptInit();                                                      //初始化外部中断触发方式
  MCU_GPIOAInit();                                                              //初始化GPIOA端口
  MCU_GPIOBInit();                                                              //初始化GPIOB端口
  MCU_GPIOCInit();                                                              //初始化GPIOC端口
  MCU_GPIODInit();                                                              //初始化GPIOD端口
  MCU_GPIOEInit();                                                              //初始化GPIOE端口
  MCU_GPIOFInit();                                                              //初始化GPIOF端口
  MCU_GPIOGInit();                                                              //初始化GPIOG端口
//  MCU_FlashInit();                                                              //初始化设备存储器
//  MCU_BEEPInit();                                                               //初始化蜂鸣器
  MCU_SPIInit();                                                                //初始化SPI通信接口
//  MCU_TIM1Init();                                                               //初始化TIM1定时器
//  MCU_TIM2Init();                                                               //初始化TIM2定时器
  MCU_TIM3Init();                                                               //初始化TIM3定时器
//  MCU_UART1Init(115200);                                                        //初始化UART1通信接口
//  MCU_IICInit();                                                                //初始化IIC通信接口
  MCU_UART3Init(115200);                                                        //初始化UART3通信接口
//  MCU_ADCInit();                                                                //初始化模数转换器
  MCU_TIM4Init();                                                               //初始化TIM4定时器

  OS_Delay(0x8000);                                                             //等待初始化完成
  OS_Delay(0x8000);                                                             //等待初始化完成
}
